{"recipes":[{"name":"Framed Eggs","description":"Egg in frame or toad in the hole—whatever you choose to call it, this recipe is a super fun way to spruce up the classic eggs and toast breakfast. Leave the yolks slightly runny so you can dip those crusty cutouts and sop up all the golden goodness on your plate!","imageUrl":"framed-egg.jpg","ingredients":["Eggs","Bread"],"steps":[{"stepNumber":1,"description":"Cut out center of each bread slice using a 2 1/2- to 3-inch heart, round, or other shaped cookie cutter. Set slices aside, reserving both bread and cutouts.","imageUrl":"framed-egg-1.jpg"},{"stepNumber":2,"description":"Heat a large nonstick skillet over medium-low heat. Lightly coat with olive oil.","imageUrl":"framed-egg-2.jpg"},{"stepNumber":3,"description":"Toast bread slices and cutouts on one side in skillet until golden and crispy, then turn each bread piece over.","imageUrl":"eggs.jpg"},{"stepNumber":4,"description":"Break an egg into center of each bread slice.","imageUrl":"framed-egg-1.jpg"},{"stepNumber":5,"description":"Cover pan and cook allow eggs to cook until whites are completely set and yolks begin to thicken but are not hard, about 5-6 minutes.","imageUrl":"framed-egg-2.jpg"},{"stepNumber":6,"description":"Season eggs with salt and pepper and serve with toasted cutouts for dipping.","imageUrl":"eggs.jpg"}]},{"name":"Cheesy Eggs","description":"Some recipes are deceptively simple. Although I first learnt how to make scrambled eggs with cheese when I was about 13, I just really did not know how great they could and would become.","imageUrl":"cheesy-eggs.jpg","ingredients":["Eggs","Cheese"],"steps":[{"stepNumber":1,"description":"In a large nonstick pan with sloped sides (even a wok shape works), melt the butter over medium-low heat, being careful to not brown the butter. If it begins to bubble, the heat is too high, so lower the heat to cook the eggs properly. (Slow and low like BBQ is the way to go with eggs.)","imageUrl":"greased-skillet.jpg"},{"stepNumber":2,"description":" Meanwhile, in a large bowl, add the eggs and 1 teaspoon cold water. Vigorously whisk until frothy and smooth. Swirl the pan around to coat the butter on the bottom and up the sides. Pour the eggs into the pan and let sit for a few seconds.","imageUrl":"eggs.jpg"}]},{"name":"Toast","description":"Toast is almost as old as civilization itself, made by the early Egyptians to put some spark back in stale bread. It's still one of the most versatile, delicious, and completely perfect snacks for breakfast or as a side at any meal. You can make toast from any kind of bread in the toaster, in the oven, over a fire, and learn to top with a variety of different things to your taste. See Step 1 to learn more about making toast.","imageUrl":"bread.jpg","ingredients":["Bread"],"steps":[{"stepNumber":1,"description":"Place toast in toaster","imageUrl":"framed-egg-2.jpg"},{"stepNumber":2,"description":"Select temperature for desired crispiness","imageUrl":"hot-skillet.jpg"},{"stepNumber":3,"description":"Push down toaster lever to begin toasting","imageUrl":"toaster.jpeg"}]},{"name":"Scrambled Eggs","description":"Scrambled eggs may be a relatively easy meal to make, but it turns out you are probably doing it wrong - according to chef Gordon Ramsay. Although scrambling a couple of eggs in a pan will result in decent eggs no matter what method you use, the celebrity chef has a unique technique that makes “scrambled eggs to die for\" - even if he does say so himself.","imageUrl":"scrambled-eggs.webp","ingredients":["Eggs"],"steps":[{"stepNumber":1,"description":"Place your skillet on the stovetop and turn on the heat. I leave the heat somewhere between medium low and medium, so it warms up but doesn\t get too hot.","imageUrl":"hot-skillet.jpg"},{"stepNumber":2,"description":"Meanwhile, prepare your eggs. Break them into a bowl with a tablespoon of water or milk, some salt and pepper. I use about 1/8 tsp salt and a pinch of pepper; you might use more or less according to taste. If you're dairy intolerant or don't like the taste of milk you can use water. I personally love the way milk enhances the flavor of the eggs.","imageUrl":"egg-prep.jpg"},{"stepNumber":3,"description":"Lightly grease your hot skillet, coating the surface with a thin layer of oil or butter (or a combination of oil and butter). If using spray oil, use caution and keep it away from any open gas flames.","imageUrl":"greased-skillet.jpg"},{"stepNumber":4,"description":"Pour the eggs into the skillet. Keep the heat on medium/medium low, you don't want to rush it here-- if the skillet is too hot the eggs will cook too quickly and become rubbery. Once you pour the eggs in they will begin to cook immediately. Using a spatula (I use a wooden or silicone spatula so I won't damage my pan's nonstick coating), begin pulling the cooked outer edges in towards the center of the eggs. Uncooked eggs will flood the area you just pulled back. If you are adding cheese, now is the time to sprinkle it into the skillet. This will allow ample time for the cheese to melt and integrate into the eggs.","imageUrl":"scramble-eggs.jpg"}]},{"name":"Cheesy Bacon","description":"nd it is the star of one of the most classic hors d’oeuvres out there, the cheese straw. It’s been a while since I made cheese straws, but they were one of the first things I made as a kid where I felt the power and the pleasure of making something that really impressed (and that… shhh… wasn’t really hard). When I picture my 8 year old self passing them at some party my parents were hosting, I can only hope that I wasn’t too eye-rollingly self-satisfied as I held up some little tray saying smugly, “Cheese straw?”","imageUrl":"cheesy-bacon.jpg","ingredients":["Bacon","Cheese"],"steps":[{"stepNumber":1,"description":"You can use any kind of packaged bacon to make these, or go for some high end bacon—either way you have the kind of nibble or appetizer that people stop talking to eat.","imageUrl":"hot-skillet.jpg"},{"stepNumber":2,"description":"Then they start talking again—often saying things like ”Oh my god and “these are insane.”","imageUrl":"greased-skillet.jpg"},{"stepNumber":3,"description":"Make sure the bacon thinly sliced, otherwise it won’t bake in the same amount of time as the puff pastry. ","imageUrl":"toaster.jpeg"}]}]}
